books = [
    {'title': 'Лев, колдунья и платяной шкаф', 'author': 'Клайв Стэйплз Льюис', 'year': '1950'},
    {'title': 'Ребекка', 'author': 'Дафна Дюморье', 'year': '1938'},
    {'title': 'Гроздья гнева', 'author': 'Джон Стейнбек', 'year': ' 1939 '},
    {'title': 'Гарри Поттер и философский камень', 'author': 'Дж. К. Роулинг', 'year': '1987'},
    {'title': 'Ветер в ивах', 'author': '	Кеннет Грэм', 'year': '1908'},
]
for index in range(len(books)):
    print(f"-------------------------Книга №{index + 1}-------------------------")
    print(f"Название: {books[index]['title']}; Автор: {books[index]['author']}")
    print(f"---------------------------{books[index]['year']}---------------------------")
    print()
    print()
